<br>

### Importando as bibliotecas
<br>

In [6]:
import pandas as pd
import numpy as np

<br>

### Chamando o arquivo limpo e verificando
<br>

In [7]:
df_titanic = pd.read_csv("titanic_github_limpo", sep=",")

In [8]:
#verificando
df_titanic.head()

#deu certo

,passenger_id,survived,p_class,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<br>

### Verificando se há linha duplicada ou se há linha completa com NaN


<br>

- Não há nenhuma duplicação;
- Não há nenhuma linha completa com NaN.

In [9]:
df_titanic.duplicated().any()

#não tem nada duplicado

False

In [10]:
df_titanic[df_titanic.isnull().all(axis=1)]

#não tem nenhum registro em que toda a linha seja nula

Empty DataFrame
Columns: [passenger_id, survived, p_class, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked]
Index: []

<br>

### Análise com o recurso .describe()
<br>

#### Observações

- Há falta de dados na coluna "age". Todas as células da linha COUNT possuem valor 1309, exceto a coluna AGE;
- As idades varias de 0.17 a 80 anos, tendo como média, 30 anos de idade;
- 37,74% dos tripulantes sobreviveram ao naufrágio.

In [19]:
df_titanic.describe()

,passenger_id,survived,p_class,age,sibsp,parch,fare
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.377387,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.484918,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

### Distribuição das idades

#### Observações

- A maioria dos passageiros possui pouco mais de vinte anos e menos de 40

- Apesar da distribuição de idades de homens e mulheres terem o pico entre 20 e 30 anos, dá para perceber que a concavidade da distribuição feminina é mais aberta e está mais à esquerda, em relação à masculina. Isso quer dizer que a maior parte das mulheres do navio eram um pouco mais novas do que os homens.

- A faixa de homens da terceira idade é maior do que a de mulheres. E, além disso, existem homens com idade entre 60 e 70 anos, sendo assim, mais novos do que as mulheres.